gatling/resources/data/token_0017_request.txt

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetIdentityVersion  xmlns="http://www.wizards.com/Service/2013-03"><requestMessage xmlns:i="http://www.w3.org/2001/XMLSchema-instance">&lt;samlp:AttributeQuery xmlns:samlp = "urn:oasis:names:tc:SAML:2.0:protocol" ID="_613a03f0-9a6d-5d58-e21e-55675438bab3" IssueInstant="2019-06-19T22:20:56Z" Version="2.0"&gt;&lt;samlp:Issuer xmlns:samlp ="urn:oasis:names:tc:SAML:2.0:assertion"/&gt;&lt;saml:Subject xmlns:saml = "urn:oasis:names:tc:SAML:2.0:assertion"&gt;&lt;saml:NameID&gt; VivTest &lt;/saml:NameID&gt;&lt;/saml:Subject&gt; &lt;saml:Attribute xmlns:saml = "urn:oasis:names:tc:SAML:2.0:assertion" Name = "UserName"/&gt;&lt;/samlp:AttributeQuery&gt;</requestMessage></GetIdentityVersion></s:Body></s:Envelope>